eldarkg/emdr1986x-std-per-lib/MDR32F9Qx_StdPeriph_Driver/src/USB_Library/MDR32F9Qx_usb_device.c
static void USB_EP_sendInDataPortion(USB_EP_TypeDef EPx, USB_EPData_Bit_TypeDef DataBitChange)
{
  USB_EPContext_TypeDef *ep = USB_EPContext + EPx;
  uint32_t i, total;

  assert_param(ep->EP_State == USB_EP_IN);

  /* Clean TX FIFO buffer */
  TX_FIFO_FORCE_EMPTY(EPx);

  /* Adjust DATA bit */
  switch (DataBitChange)
  {
    case USB_DATA_BIT_KEEP:
      break;
    case USB_DATA_BIT_TOGGLE:
      USB_SEPxToggleEPDATASEQ(EPx);
      break;
    case USB_DATA_BIT_DATA1:
      USB_SetSEPxCTRL(EPx, USB_SEPx_CTRL_EPDATASEQ_Data1);
      break;
  }

  /* Copy data portion into TX FIFO buffer */
  total = (ep->Buffer.IO_Buffer.offset + ep->Buffer.IO_Buffer.bytesToAck < ep->Buffer.IO_Buffer.length ?
            ep->Buffer.IO_Buffer.offset + ep->Buffer.IO_Buffer.bytesToAck : ep->Buffer.IO_Buffer.length);
  for (i = ep->Buffer.IO_Buffer.offset; i < total; i++)
  {
    USB_SetSEPxTXFD(EPx, ep->Buffer.IO_Buffer.pBuffer[i]);
  };

  /* Set EPRDY bit */
  USB_EP_SetReady(EPx, USB_SEPx_CTRL_EPRDY_Ready);
}


/**
  * @brief  Sets EPRDY and STALL bits (service function).
  *
  * @param  EPx: USB EndPoint number.
  *         This parameter can be one of the following values:
  *         USB_EP0, USB_EP1, USB_EP2, USB_EP3.
  *
  * @param  val: Value for SEPxCTRL register.
  *
  * @retval USB_Result.
  *
  * @note   Before setting EPRDY, the function clears pending
  *         bits (especially SCTDONE), to indicate that previous
  *         transaction is complete.
  */

static void USB_EP_SetReady(USB_EP_TypeDef EPx, uint32_t val)
{
  USB_EPContext_TypeDef *ep = USB_EPContext + EPx;

  /* Clear pending bits */
  USB_SetSIS(USB_SIS_Msk);

  ep->EP_WasScdone = RESET;

  /* Set CTRL bits */
  USB_SetSEPxCTRL(EPx, val);
}

/** @} */ /* End of group USB_EndPoint_Private_Functions */

/** @} */ /* End of group USB_EndPoint */

/** @defgroup USB_Device USB Device
  * @{
  */

/** @defgroup USB_Device_Private_Types USB Device Private Types
  * @{
  */

/** @} */ /* End of group USB_Device_Private_Types */

/** @defgroup USB_Device_Private_Constants USB Device Private Constants
  * @{
  */

/** @} */ /* End of group USB_Device_Private_Constants */

/** @defgroup USB_Device_Private_Variables USB Device Private Variables
  * @{
  */

USB_SetupPacket_TypeDef USB_CurrentSetupPacket;
USB_DeviceContext_TypeDef USB_DeviceContext;
static uint8_t SetupPacketData[2];

/** @} */ /* End of group USB_Device_Private_Variables */

/** @defgroup USB_Device_Private_Macros USB Device Private Macros
  * @{
  */

/** @} */ /* End of group USB_Device_Private_Macros */

/** @defgroup USB_Device_Private_FunctionPrototypes USB Device Private Function Prototypes
  * @{
  */

static USB_Result USB_Device_setAddressWork(USB_EP_TypeDef EPx, uint8_t* Buffer, uint32_t Length);

/** @} */ /* End of group USB_Device_Private_FunctionPrototypes */

/** @defgroup USB_Device_Private_Functions USB Device Private Functions
  * @{
  */

/**
  * @brief  Initializes the USB peripheral according to the specified
  *         parameters in the USB_Clock_InitStruct.
  * @param  USB_Clock_InitStruct: pointer to a USB_Clock_TypeDef structure
  *         that contains the configuration information for the USB Clock.
  *
  * @param  USB_DeviceBUSParam: pointer to a USB_DeviceBUSParam_TypeDef structure
  *         that contains the configuration information for the USB BUS
  *
  * @retval USB_Result.
  */

USB_Result USB_DeviceInit(const USB_Clock_TypeDef* USB_Clock_InitStruct, USB_DeviceBUSParam_TypeDef* USB_DeviceBUSParam)
{
  /* Check the parameters */
  assert_param(IS_USB_PULL(USB_DeviceBUSParam->PULL));
  assert_param(IS_USB_SPEED(USB_DeviceBUSParam->SPEED));
  assert_param(IS_USB_MODE(USB_DeviceBUSParam->MODE));

  /* Set USB clocks perform controller reset */
  USB_BRGInit(USB_Clock_InitStruct);
  USB_Reset();
  /* Set pulls and Device mode */
  USB_SetHSCR(USB_HSCR_HOST_MODE_Device);
  USB_SetHSCR(USB_DeviceBUSParam->PULL);
  /* Set speed, polarity and enable end points */
  USB_SetSC(USB_DeviceBUSParam->SPEED | USB_DeviceBUSParam->MODE | USB_SC_SCGEN_Set);
  /* Setup EP0 */
  USB_EP_Init(USB_EP0, USB_SEPx_CTRL_EPEN_Enable | USB_SEPx_CTRL_EPDATASEQ_Data1, 0);
  USB_EP_setSetupHandler(USB_EP0, &USB_CurrentSetupPacket, USB_DEVICE_HANDLE_SETUP);

  USB_DeviceContext.USB_DeviceState = USB_DEV_STATE_UNKNOWN;
  USB_DeviceContext.Address = 0;

  return USB_SUCCESS;
}

/**
  * @brief  Enables the USB peripheral.
  *
  * @param  None
  *
  * @retval USB_Result.
  */

USB_Result USB_DevicePowerOn(void)
{
  USB_SetHSCR(USB_HSCR_EN_RX_Set | USB_HSCR_EN_TX_Set);
  USB_DeviceContext.USB_DeviceState = USB_DEV_STATE_POWERED;

  return USB_SUCCESS;
}

/**
  * @brief  Disables the USB peripheral.
  *
  * @param  None
  *
  * @retval USB_Result.
  */

USB_Result USB_DevicePowerOff(void)
{
  USB_SetHSCR(USB_HSCR_EN_RX_Reset);
  USB_DeviceContext.USB_DeviceState = USB_DEV_STATE_UNKNOWN;

  return USB_SUCCESS;
}

#ifdef USB_REMOTE_WAKEUP_SUPPORTED
/**
  * @brief  Initiates host remote wakeup
  *
  * @param  None
  *
  * @retval USB_Result.
  */

USB_Result USB_DeviceRemoteWakeUp(void)
{
  return USB_SUCCESS;
}
#endif /* USB_REMOTE_WAKEUP_SUPPORTED */

/** @defgroup USB_Device_Private_Handlers USB Device Handlers implementation
  * @{
  */

/**
  * @brief  Reset bus handler
  *
  * @param  None
  *
  * @retval USB_Result.
  */

USB_Result USB_DeviceReset(void)
{
  USB_DeviceContext.USB_DeviceState = USB_DEV_STATE_DEFAULT;
  return USB_SUCCESS;
}

/**
  * @brief  Performs all necessary actions on entering to SUSPENDED state
  *
  * @param  None
  *
  * @retval USB_Result.
  */

USB_Result USB_DeviceSuspend(void)
{
  return USB_SUCCESS;
}

/**
  * @brief  Performs all necessary actions on exit from SUSPENDED state
  *
  * @param  None
  *
  * @retval USB_Result.
  */

USB_Result USB_DeviceResume(void)
{
  return USB_SUCCESS;
}

/**
  * @brief  Control Setup Packet processing dispatcher (set as EP0 setup
  *         packet handler).
  *
  * @param  EPx: USB Control EndPoint (EP0) number.
  *
  * @param  USB_SetupPacket: Pointer to a USB_SetupPacket_TypeDef structure
  *         that contains received setup packet contents (on success)
  *
  * @retval USB_Result.
  *
  * @note   This function interface reflects EndPoint setup packet handler
  *         requirements. Request setup packet data is placed into
  *         USB_CurrentSetupPacket variable to be accessible from the
  *         specific request type handlers.
  */

USB_Result USB_DeviceSetupPacket(USB_EP_TypeDef EPx, const USB_SetupPacket_TypeDef* USB_SetupPacket)
{
  USB_RequestType_TypeDef requestType;
  USB_RequestTypeDT_TypeDef requestDirection;

  USB_Result result = USB_SUCCESS;
  uint16_t wValue, wIndex, wLength;

  /* Check the parameters */
  assert_param(IS_USB_ENDPOINT(EPx));

