eldarkg/emdr1986x-std-per-lib/MDR32F9Qx_StdPeriph_Driver/src/USB_Library/MDR32F9Qx_usb_device.c
/** @} */ /* End of group USB_Device_Private_Handlers */

/** @defgroup USB_Device_deviceSetupPacket_Handlers USB Device Standard Request specific handlers
  * @{
  */

/**
  * @brief  Called on CLEAR_FEATURE request (9.4.1).
  *
  * @param  Recipient: Recipient type (from setup packet header).
  *         This parameter can be one of the following values:
  *         USB_RECIPIENT_DEVICE, USB_RECIPIENT_INTERFACE,
  *         USB_RECIPIENT_ENDPOINT, USB_RECIPIENT_OTHER.
  *
  * @param  wVALUE: Feature selector.
  *
  * @param  wINDEX: Interface or EndPoint number, if Recipient has
  *         appropriate value.
  *
  * @retval USB_Result.
  *
  * @note   This handler is called in correct state only. This implementation
  *         process ENDPOINT_HALT (calling USB_EP_Ready) and DEVICE_REMOTE_WAKEUP
  *         (clearing RemoteWakeupEnabled context flag) standard features only.
  */

USB_Result USB_DeviceClearFeature(USB_RequestRecipient_TypeDef Recipient, uint16_t wVALUE, uint16_t wINDEX)
{
  if ((Recipient == USB_RECIPIENT_ENDPOINT) && (wVALUE == USB_ENDPOINT_HALT))
  {
    return USB_EP_Idle((USB_EP_TypeDef)wINDEX);
  }
  else
  {
    return USB_ERROR;
  }
}

/**
  * @brief  Called on SET_FEATURE request (9.4.9).
  *
  * @param  Recipient: Recipient type (from setup packet header).
  *         This parameter can be one of the following values:
  *         USB_RECIPIENT_DEVICE, USB_RECIPIENT_INTERFACE,
  *         USB_RECIPIENT_ENDPOINT, USB_RECIPIENT_OTHER.
  *
  * @param  wVALUE: Feature selector.
  *
  * @param  wINDEX: Interface or EndPoint number, if Recipient has
  *         appropriate value.
  *
  * @retval USB_Result.
  *
  * @note   This handler is called in correct state only. This implementation
  *         process ENDPOINT_HALT (calling USB_EP_Stall) and DEVICE_REMOTE_WAKEUP
  *         (setting RemoteWakeupEnabled context flag) standard features only.
  */

USB_Result USB_DeviceSetFeature(USB_RequestRecipient_TypeDef Recipient, uint16_t wVALUE, uint16_t wINDEX)
{
  if ((Recipient == USB_RECIPIENT_ENDPOINT) && (wVALUE == USB_ENDPOINT_HALT))
  {
    return USB_EP_Stall((USB_EP_TypeDef)wINDEX, USB_STALL_HALT);
  }
  else
  {
    return USB_ERROR;
  }
}

/** @} */ /* End of group USB_Device_deviceSetupPacket_Handlers */

/** @defgroup USB_Device_Status_Stage_Handlers USB Device Service Functions
  * @{
  */

/**
  * @brief Implements Status stage of Setup transaction with OUT data stage
  *        or without data stage. To be used as EndPoint transaction handler.
  *
  * @param  EPx: USB EndPoint number.
  *         This parameter can be one of the following values:
  *         USB_EP0, USB_EP1, USB_EP2, USB_EP3.
  *
  * @param  Buffer: Pointer to the user's buffer with portion of data
  *                 to be sent
  *
  * @param  Length: Length of data portion
  *
  * @retval USB_Result.
  *
  * @note   This function interface reflects EndPoint data transmitting handler
  *         requirements.
  */

USB_Result USB_DeviceDoStatusInAck(USB_EP_TypeDef EPx, uint8_t* Buffer, uint32_t Length)
{
  (void)EPx;
  (void)Buffer;
  (void)Length;

  return USB_SUCCESS;
}

/**
  * @brief Implements Status stage of Setup transaction with IN data stage.
  *        To be used as EndPoint transaction handler.
  *
  * @param  EPx: USB EndPoint number.
  *         This parameter can be one of the following values:
  *         USB_EP0, USB_EP1, USB_EP2, USB_EP3.
  *
  * @param  Buffer: Pointer to the user's buffer for next portion of data
  *
  * @param  Length: Length of data portion
  *
  * @retval USB_Result.
  *
  * @note   This function interface reflects EndPoint data transmitting handler
  *         requirements.
  */

USB_Result USB_DeviceDoStatusOutAck(USB_EP_TypeDef EPx, uint8_t* Buffer, uint32_t Length)
{
  (void)Buffer;
  (void)Length;

  return USB_EP_doDataOut(EPx, 0, 0, 0);
}

/**
  * @brief Implements Status stage of Setup SET_ADDRESS transaction.
  *        Actually changes the device address. To be used as EndPoint
  *        transaction handler.
  *
  * @param  EPx: USB EndPoint number.
  *         This parameter can be one of the following values:
  *         USB_EP0, USB_EP1, USB_EP2, USB_EP3.
  *
  * @param  Buffer: Pointer to the user's buffer with portion of data
  *                 to be sent
  *
  * @param  Length: Length of data portion
  *
  * @retval USB_Result.
  *
  * @note   This function interface reflects EndPoint data transmitting handler
  *         requirements.
  */

static USB_Result USB_Device_setAddressWork(USB_EP_TypeDef EPx, uint8_t* Buffer, uint32_t Length)
{
  (void)EPx;
  (void)Buffer;
  (void)Length;

  /* Set address */
  USB_SetSA(USB_DeviceContext.Address);
  /* Adjust device state */
  USB_DeviceContext.USB_DeviceState = (USB_DeviceContext.Address ? USB_DEV_STATE_ADDRESS : USB_DEV_STATE_DEFAULT);

  return USB_SUCCESS;
}

/** @} */ /* End of group USB_Device_Status stage _Handlers */

/**
  * @brief  USB interrupt dispatcher, called from interrupt handler
  *
  * @param  None
  *
  * @retval USB_Result.
  *
  * @note   Handles common events (such as Reset) and calls USB_EP_setSetupHandler
  *         for each EndPoint in use.
  */

USB_Result USB_DeviceDispatchEvent(void)
{
  uint32_t i;
  uint32_t USB_IT;
  USB_Result result = USB_SUCCESS;
  static volatile uint32_t bHandling = RESET;

  /* Disable USB interrupts */
#ifdef USB_INT_HANDLE_REQUIRED
  NVIC_DisableIRQ(USB_IRQn);
#endif /* USB_INT_HANDLE_REQUIRED */

  if (!bHandling) {
    bHandling = SET;

    /* Get masked interrupt flags */
    USB_IT = USB_GetSIS();
    /* Handle reset */
    if (USB_IT & USB_SIS_SCRESETEV)
    {
      result = USB_DeviceReset();
    }

    /* Invoke End Point dispatchers */
    for (i = USB_EP0; i < Num_USB_EndPoints; i++)
    {
      USB_EP_dispatchEvent((USB_EP_TypeDef)i, USB_IT);
    }

    /* Clear pending bits, except for SCTDONE */
    USB_SetSIS(USB_IT & (~USB_SIS_SCTDONE_Set));

