eldarkg/emdr1986x-std-per-lib/MDR32F9Qx_StdPeriph_Driver/src/USB_Library/MDR32F9Qx_usb_device.c
    bHandling = RESET;

    /* Enable USB interrupts (only after the actual work is done) */
#ifdef USB_INT_HANDLE_REQUIRED
    NVIC_EnableIRQ(USB_IRQn);
#endif /* USB_INT_HANDLE_REQUIRED */
  }
  return result;
}

#ifdef USB_INT_HANDLE_REQUIRED
/**
  * @brief  Default implementation of USB interrupt handler
  *
  * @param  None
  *
  * @retval None
  *
  * @note   To be overwritten, USB_INT_HANDLE_REQUIRED definition should be
  *         undefined.
  *
  */

void USB_IRQHandler(void)
{
  USB_DeviceDispatchEvent();
}
#endif /* USB_INT_HANDLE_REQUIRED */


/** @defgroup USB_Device_Private_Dummy_Functions USB Device Private Handler Samples
  * @{
  */

/**
  * @brief  GET_STATUS standard request handler sample (9.4.5).
  *
  * @param  Recipient: Recipient type (from setup packet header).
  *         This parameter can be one of the following values:
  *         USB_RECIPIENT_DEVICE, USB_RECIPIENT_INTERFACE,
  *         USB_RECIPIENT_ENDPOINT, USB_RECIPIENT_OTHER.
  *
  * @param  wINDEX: Interface or EndPoint number, if Recipient has
  *         appropriate value.
  *
  * @retval USB_Result.
  *
  * @note   Intended to update USB_DeviceStatus field of the device context
  *         before the status to be sent to host. Data stage begins if USB_SUCCESS
  *         is returned.
  */

USB_Result USB_DeviceDummyGetStatus(USB_RequestRecipient_TypeDef Recipient, uint16_t wINDEX)
{
  (void)Recipient;
  (void)wINDEX;

  return USB_SUCCESS;
}

/**
  * @brief  SET_ADDRESS standard request handler (preparation) sample (9.4.6).
  *
  * @param  wVALUE: New device address
  *
  * @retval USB_Result.
  *
  * @note   Intended to do perform actions while still in setup transaction
  *         (actual address change to be performed after status stage completes).
  *         If value returned is not USB_SUCCESS, transaction is aborted.
  */

USB_Result USB_DeviceDummySetAddress(uint16_t wVALUE)
{
  (void)wVALUE;

  return USB_SUCCESS;
}

/**
  * @brief  GET_DESCRIPTOR standard request handler sample (9.4.3).
  *
  * @param  wVALUE: Descriptor Type and Descriptor Index
  *
  * @param  wINDEX: Zero or Language ID (see 9.6.7)
  *
  * @param  wLENGTH: Amount of data host is willing to receive.
  *
  * @retval USB_Result.
  *
  * @note   This handler is called in correct state only. It's to be implemented
  *         in any device class. It is expected to either perform data transfer
  *         and status stages on its own (calling USB_EP_doDataIn), or return
  *         value that is not USB_SUCCESS.
  */

USB_Result USB_DeviceDummyGetDescriptor(uint16_t wVALUE, uint16_t wINDEX, uint16_t wLENGTH)
{
  (void)wVALUE;
  (void)wINDEX;
  (void)wLENGTH;

  return USB_ERROR;
}

/**
  * @brief  SET_DESCRIPTOR standard request handler sample (9.4.8).
  *
  * @param  wVALUE: Descriptor Type and Descriptor Index
  *
  * @param  wINDEX: Zero or Language ID (see 9.6.7)
  *
  * @param  wLENGTH: Amount of data to be sent by host.
  *
  * @retval USB_Result.
  *
  * @note   This handler is called in correct state only. It's to be implemented
  *         only if the device supports descriptor update by host. It is expected
  *         to either perform data transfer and status stages on its own (calling
  *         USB_EP_doDataOut), or return value that is not USB_SUCCESS.
  */

USB_Result USB_DeviceDummySetDescriptor(uint16_t wVALUE, uint16_t wINDEX, uint16_t wLENGTH)
{
  (void)wVALUE;
  (void)wINDEX;
  (void)wLENGTH;

  return USB_ERROR;
}

/**
  * @brief  GET_CONFIGURATION standard request handler sample (9.4.2).
  *
  * @param  None
  *
  * @retval Currently selected configuration number or 0 on error.
  *
  * @note   This handler is called in correct state only. It's to be implemented
  *         if the device supports more than one configuration.
  */

uint8_t USB_DeviceDummyGetConfiguration(void)
{
  return 1;
}

/**
  * @brief  SET_CONFIGURATION standard request handler sample (9.4.7).
  *
  * @param  wVALUE: Configuration number
  *
  * @retval USB_Result.
  *
  * @note   This handler is called in correct state only. It's to be implemented
  *         if the device supports more than one configuration.
  */

USB_Result USB_DeviceDummySetConfiguration(uint16_t wVALUE)
{
  (void)wVALUE;

  return USB_ERROR;
}

/**
  * @brief  GET_INTERFACE standard request handler sample (9.4.4).
  *
  * @param  wINDEX: Interface number.
  *
  * @retval Currently selected alternate setting for the specified interface
  *         or 0 in case of error.
  *
  * @note   This handler is called in correct state only. It's to be implemented
  *         if the device supports interfaces with alternate settings.
  */

uint8_t USB_DeviceDummyGetInterface(uint16_t wINDEX)
{
  (void)wINDEX;

  return 0;
}

/**
  * @brief  SET_INTERFACE standard request handler sample (9.4.10).
  *
  * @param  wVALUE: Alternate setting to be set.
  *
  * @param  wINDEX: Interface number.
  *
  * @retval USB_Result.
  *
  * @note   This handler is called in correct state only. It's to be implemented
  *         if the device supports interfaces with alternate settings.
  */

USB_Result USB_DeviceDummySetInterface(uint16_t wVALUE, uint16_t wINDEX)
{
  (void)wVALUE;
  (void)wINDEX;

  return USB_SUCCESS;
}

/**
  * @brief  SYNC_FRAME standard request handler sample (9.4.11).
  *
  * @param  wINDEX: EndPoint number.
  *
  * @param  DATA: Pointer for frame number.
  *
  * @retval USB_Result.
  *
  * @note   This handler is called in correct state only. It's to be implemented
  *         if some of the device EndPoints support isochronous transfers. It is
  *         expected to place EndPoint synchronization frame number into DATA pointed
  *         location or return value that is not USB_SUCCESS.
  */

USB_Result USB_DeviceDummySyncFrame(uint16_t wINDEX, uint8_t* DATA)
{
  (void)wINDEX;
  (void)DATA;

  return USB_ERROR;
}

/**
  * @brief  Class-type setup request handler sample.
  *
  * @param  None
  *
  * @retval USB_Result.
  *
  * @note   This handler is called in correct state only. It's to be implemented
  *         the device supports any class-type requests. Request setup packet data
  *         is accessible by USB_CurrentSetupPacket variable. The overwritten method
  *         should implement both data (if present) and status transfer stages.
  */

