eldarkg/emdr1986x-std-per-lib/MDR32F9Qx_StdPeriph_Driver/src/USB_Library/MDR32F9Qx_usb_device.c
USB_Result USB_DeviceDummyClassRequest(void)
{
  return USB_ERROR;
}

/**
  * @brief  Vendor-type setup request handler sample.
  *
  * @param  None
  *
  * @retval USB_Result.
  *
  * @note   This handler is called in correct state only. It's to be implemented
  *         the device supports any vendor-type requests. Request setup packet data
  *         is accessible by USB_CurrentSetupPacket variable. The overwritten method
  *         should implement both data (if present) and status transfer stages.
  */


USB_Result USB_DeviceDummyVendorRequest(void)
{
  return USB_ERROR;
}


/**
  * @brief  EndPoint error handler sample.
  *
  * @param  EPx: USB EndPoint number.
  *         This parameter can be one of the following values:
  *         USB_EP0, USB_EP1, USB_EP2, USB_EP3.
  *
  * @param  STS: USB_SEPx.STS register value.
  *
  * @param  TS: USB_SEPx.TS register value.
  *
  * @param  CTRL: USB_SEPx.CTRL register value.
  *
  * @retval USB_Result.
  *
  * @note   This function interface reflects EndPoint error handler
  *         requirements. When called on IN transaction error:
  *          - if it hasn't start another transaction and returns USB_SUCCESS,
  *            then retry of data transmission would occur;
  *          - if it returns error code, EndPoint would be switched to
  *            NAK/STALL state.
  */

USB_Result USB_DeviceDummyDataError(USB_EP_TypeDef EPx, uint32_t STS, uint32_t TS, uint32_t CTRL)
{
  (void)EPx;
  (void)STS;
  (void)TS;
  (void)CTRL;

  return USB_ERROR;
}

/** @} */ /* End of group USB_Device_Private_Dummy_Functions */


/** @} */ /* End of group USB_Device_Private_Functions */

/** @} */ /* End of group USB_Device */

/** @} */ /* End of group USB_DEVICE_AND_CDC */

/** @} */ /* End of group MDR32F9Qx_StdPeriph_Driver */

/******************* (C) COPYRIGHT 2011 Phyton *********
*
* END OF FILE MDR32F9Qx_usb_device.c */

